FKDD_COPY_DIFF_3_2026-02-14/Documents/ОтражениеФактическихЗначенийKPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОтражениеФактическихЗначенийKPI</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ФактическиеЗначенияKPI</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПоследнегоИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОперацииВводаФакта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОбъект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииДолжностейСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПерсональныеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.KPI</v8:Type>
								<v8:Type>cfg:CatalogRef.ПоказателиДляРасчетаМотивации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбщиеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.KPI</v8:Type>
								<v8:Type>cfg:CatalogRef.ПоказателиДляРасчетаМотивации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ФактическиеЗначенияKPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФактическиеЗначенияKPI</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Факт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>KPI</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.KPI</v8:Type>
						<v8:Type>cfg:CatalogRef.ПоказателиДляРасчетаМотивации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>Периодичность</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
					<Comment>Неделя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
					<Comment>Декада</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
					<Comment>Месяц</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
					<Comment>Квартал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
					<Comment>Год</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
					<Comment>Произвольный</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/ОтражениеФактическихЗначенийKPI/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Периодичность=Перечисления.Периодичность.Месяц Тогда
		НачПериода=НачалоМесяца(ПериодПланирования);
		КонПериода=КонецМесяца(ПериодПланирования);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Квартал Тогда
		НачПериода=НачалоКвартала(ПериодПланирования);
		КонПериода=КонецКвартала(ПериодПланирования);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Год Тогда
		НачПериода=НачалоГода(ПериодПланирования);
		КонПериода=КонецГода(ПериодПланирования);
	Иначе
		Сообщить("Неверная периодичность");
		Отказ=истина;
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Для Каждого ТекСтр из  ПерсональныеПоказатели Цикл
			
			Если ТипЗнч(ТекСтр.Показатель)=Тип("СправочникСсылка.ПоказателиДляРасчетаМотивации") Тогда
				Пок=УзнатьПоказатель(текСтр.Показатель);
			Иначе
				Пок=ТекСтр.Показатель;
			КонецЕсли;
			
			Если Пок=Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Сотрудники.Сортировать("Сотрудник");
	
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	ОтражениеФактическихЗначенийKPI.Ссылка
		|ИЗ                                             
		|	Документ.ОтражениеФактическихЗначенийKPI КАК ОтражениеФактическихЗначенийKPI
		|ГДЕ
		|	ОтражениеФактическихЗначенийKPI.Ссылка <> &Ссылка
		|	И ОтражениеФактическихЗначенийKPI.Периодичность = &Периодичность
		|	И ОтражениеФактическихЗначенийKPI.ПериодПланирования = &ПериодПланирования
		|	И ОтражениеФактическихЗначенийKPI.ВидОперации = &ВидОперации
		|	И ОтражениеФактическихЗначенийKPI.ПодразделениеКомпании = &ПодразделениеКомпании
		|	И НЕ ОтражениеФактическихЗначенийKPI.ПометкаУдаления");
		
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("ПериодПланирования",ЭтотОбъект.ПериодПланирования);
		Запрос.УстановитьПараметр("Периодичность",ЭтотОбъект.Периодичность);
		Запрос.УстановитьПараметр("ВидОперации",ЭтотОбъект.ВидОперации);
		Запрос.УстановитьПараметр("ПодразделениеКомпании",ЭтотОбъект.ПодразделениеКомпании);
		
		Выб=Запрос.Выполнить().Выбрать();
		
		Если Выб.Следующий() Тогда
			Сообщить("В этот период уже есть аналогичный документ "+Выб.Ссылка);
			Отказ=истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УзнатьПоказатель(Эл)
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	KPIПоказателиДляРасчета.Ссылка
	|ИЗ
	|	Справочник.KPI.ПоказателиДляРасчета КАК KPIПоказателиДляРасчета
	|ГДЕ
	|	KPIПоказателиДляРасчета.Показатель = &Показатель
	|	И KPIПоказателиДляРасчета.Ссылка.ИмеетПереодическоеОписание
	|	И KPIПоказателиДляРасчета.Ссылка.ПодразделениеКомпании = &Подразделение");
	
	Запрос.УстановитьПараметр("Показатель", Эл);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);
	
	Выб=Запрос.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		Возврат Выб.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
    // регистр ФактическиеЗначенияKPI
	Если ПустаяСтрока(ЭтотОбъект.ПодразделениеКомпании) Тогда
		Отказ=истина;
		Сообщить("Не заполнено подразделение компании");
		Возврат;
	КонецЕсли;
	
	дат = НачалоМесяца(ТекущаяДата()-86400*5);
	дат = ?(Дат < НачалоКвартала(Дата), НачалоКвартала(Дата),Дат);
	Дат = ?(Дат < КонецКвартала(Дата) И КонецМесяца(Дат) > КонецКвартала(Дата),НачалоМесяца(КонецКвартала(Дата)),Дат);
	
	Движения.ФактическиеЗначенияKPI.Записывать = Истина;
	Движения.ФактическиеЗначенияKPI.Очистить();
	
	Для Каждого ТекСтрокаФактKPI Из ПерсональныеПоказатели Цикл
		
			Движение = Движения.ФактическиеЗначенияKPI.Добавить();
			Движение.Период = ПериодПланирования;
			Движение.Сотрудник = ТекСтрокаФактKPI.Сотрудник;
			Движение.Должность = ТекСтрокаФактKPI.Сотрудник.Должность;
			Движение.KPI = ТекСтрокаФактKPI.Показатель;
			Движение.Организация = Организация;
			
			Если ТипЗнч(ТекСтрокаФактKPI.Показатель)=ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
				Движение.Периодичность = ТекСтрокаФактKPI.Показатель.Периодичность;
				ДПериодичность = ТекСтрокаФактKPI.Показатель.Периодичность;
			Иначе
				Движение.Периодичность = Периодичность;
				ДПериодичность = Периодичность;
			КонецЕсли;
			Движение.Факт = ТекСтрокаФактKPI.Факт;
			Движение.ПодразделениеКомпании=ПодразделениеКомпании;
		
		КонецЦикла;
		
		Для Каждого ТекСтрокаФактKPI Из ОбщиеПоказатели Цикл
			
			Движение = Движения.ФактическиеЗначенияKPI.Добавить();
			Движение.Период = ПериодПланирования;
			Движение.Сотрудник = "";
			Движение.KPI = ТекСтрокаФактKPI.Показатель;
			Движение.Организация = Организация;
			
			Если ТипЗнч(ТекСтрокаФактKPI.Показатель)=ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
				Движение.Периодичность = ТекСтрокаФактKPI.Показатель.Периодичность;
			Иначе
				Движение.Периодичность = Периодичность;
			КонецЕсли;
			
			Движение.Факт = ТекСтрокаФактKPI.Факт;
			Движение.ПодразделениеКомпании=ПодразделениеКомпании;
			
		КонецЦикла;
	
КонецПроцедуры
